arduino/ArduinoCore-samd/boards.txt

arduino_zero_dbg.name=Arduino Zero (Programming Port)
arduino_zero_dbg.vid.0=0x03eb
arduino_zero_dbg.pid.0=0x2111
arduino_zero_dbg.upload.tool=bossac
arduino_zero_dbg.upload.protocol=sam-ba
arduino_zero_dbg.upload.maximum_size=262144
arduino_zero_dbg.upload.use_1200bps_touch=false
arduino_zero_dbg.upload.wait_for_upload_port=false
arduino_zero_dbg.upload.native_usb=false
arduino_zero_dbg.build.mcu=cortex-m0plus
arduino_zero_dbg.build.f_cpu=48000000L
arduino_zero_dbg.build.usb_product="Arduino Zero"
arduino_zero_dbg.build.board=SAM_ZERO
arduino_zero_dbg.build.core=arduino
arduino_zero_dbg.build.extra_flags=-D__SAMD21G18A__ -mthumb {build.usb_flags}
arduino_zero_dbg.build.ldscript=linker_scripts/gcc/flash.ld
arduino_zero_dbg.build.variant=arduino_zero
arduino_zero_dbg.build.variant_system_lib=
arduino_zero_dbg.build.vid=0x03eb
arduino_zero_dbg.build.pid=0x2111

arduino_zero.name=Arduino Zero (Native USB Port)
arduino_zero.vid.0=0x2341
arduino_zero.pid.0=0x004d
arduino_zero.upload.tool=bossac
arduino_zero.upload.protocol=sam-ba
arduino_zero.upload.maximum_size=262144
arduino_zero.upload.use_1200bps_touch=false
arduino_zero.upload.wait_for_upload_port=false
arduino_zero.upload.native_usb=true
arduino_zero.build.mcu=cortex-m0plus
arduino_zero.build.f_cpu=48000000L
arduino_zero.build.usb_product="Arduino Zero"
arduino_zero.build.board=SAM_ZERO
arduino_zero.build.core=arduino
arduino_zero.build.extra_flags=-D__SAMD21G18A__ -mthumb {build.usb_flags}
arduino_zero.build.ldscript=linker_scripts/gcc/flash.ld
arduino_zero.build.variant=arduino_zero
arduino_zero.build.variant_system_lib=
arduino_zero.build.vid=0x2341
arduino_zero.build.pid=0x004d
